In [3]:
import pandas as pd

In [4]:
# 1) apply
# 2) concat
# 3) append
# 4) merge

In [5]:
df = pd.DataFrame({'id':[1,2,3],
                  'name':['qa','daawd','ncnsk'],
                  'sal':[9937587,150000,250499]})

In [6]:
df

   id   name      sal
0   1     qa  9937587
1   2  daawd   150000
2   3  ncnsk   250499

In [8]:
def q1(sa):
    return sa*sa

In [10]:
df['new_sal']=df['sal'].apply(q1)

In [11]:
df

   id   name      sal         new_sal
0   1     qa  9937587  98755635382569
1   2  daawd   150000     22500000000
2   3  ncnsk   250499     62749749001

In [21]:
df1 = pd.DataFrame({'id':[1,2,3],
                  'ids':[25,98,99],
                  'sal':[9937587,150000,250499]})

In [22]:
df1

   id  ids      sal
0   1   25  9937587
1   2   98   150000
2   3   99   250499

In [23]:
def q1(sa):
    return sa*sa

In [24]:
#df1['new_sal']=df1['sal'].apply(q1)

In [25]:
df1.apply(q1)

   id   ids             sal
0   1   625  98755635382569
1   4  9604     22500000000
2   9  9801     62749749001

In [ ]:
# apply ---> 2D ( use in dataframe and series)
# map ----> only for series

In [36]:
df2 = pd.DataFrame({'city':['pune','mumbai','jaipur'],
                   'sal_city':['nagpur','patna','kolkata']})

In [37]:
df2

     city sal_city
0    pune   nagpur
1  mumbai    patna
2  jaipur  kolkata

In [38]:
df2['city']=df2['city'].apply(lambda x:x.upper()) # , df2['sal_city']=df2['sal_city'].apply(lambda x:x.upper())

In [39]:
df2

     city sal_city
0    PUNE   nagpur
1  MUMBAI    patna
2  JAIPUR  kolkata

In [40]:
df3 = pd.DataFrame({'country':['India@','USA#','Canada$'],
                   'city':['@mumbai',"*pune",'#chennai']})

In [41]:
df3

   country      city
0   India@   @mumbai
1     USA#     *pune
2  Canada$  #chennai

In [42]:
import re

In [43]:
def clean(s):
    s = re.sub('[^A-Za-z]','',s)
    return s

In [44]:
df3['country']=df3['country'].apply(clean)

In [45]:
df3

  country      city
0   India   @mumbai
1     USA     *pune
2  Canada  #chennai

In [47]:
df3['city']=df3['city'].apply(clean)

In [48]:
df3

  country     city
0   India   mumbai
1     USA     pune
2  Canada  chennai

In [56]:
df4 = pd.DataFrame({'country':['India','Pakisthan','Japan'],
                   'city':['jaipur',"sikar",'Jhunjhunu'],
                    'Raj_cities':['jhodpur','nagaur','kota']})

In [57]:
df4

     country       city Raj_cities
0      India     jaipur    jhodpur
1  Pakisthan      sikar     nagaur
2      Japan  Jhunjhunu       kota

In [59]:
df3.append(df4,ignore_index=True)

C:\Users\jangi\AppData\Local\Temp\ipykernel_7424\1075447084.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df3.append(df4,ignore_index=True)

     country       city Raj_cities
0      India     mumbai        NaN
1        USA       pune        NaN
2     Canada    chennai        NaN
3      India     jaipur    jhodpur
4  Pakisthan      sikar     nagaur
5      Japan  Jhunjhunu       kota

In [60]:
# to drop col_name=[Raj_cities] -- we use df4.drop('Raj_cities',axis=1,inplace=True)

In [63]:
df4.drop('Raj_cities',axis=1,inplace=True)

In [64]:
df4

     country       city
0      India     jaipur
1  Pakisthan      sikar
2      Japan  Jhunjhunu

In [65]:
df3

  country     city
0   India   mumbai
1     USA     pune
2  Canada  chennai

In [66]:
pd.concat([df3,df4])

     country       city
0      India     mumbai
1        USA       pune
2     Canada    chennai
0      India     jaipur
1  Pakisthan      sikar
2      Japan  Jhunjhunu

In [71]:
df5 = pd.concat([df3,df4],axis=1)
df5

  country     city    country       city
0   India   mumbai      India     jaipur
1     USA     pune  Pakisthan      sikar
2  Canada  chennai      Japan  Jhunjhunu

In [68]:
df6 = pd.DataFrame({'pop':[21344,45576,87877867]})

In [69]:
df6

        pop
0     21344
1     45576
2  87877867

In [86]:
df8 = pd.concat([df5,df6],axis=1)

In [88]:
df8

  country     city    country       city       pop
0   India   mumbai      India     jaipur     21344
1     USA     pune  Pakisthan      sikar     45576
2  Canada  chennai      Japan  Jhunjhunu  87877867

In [92]:
pd.concat([df7,df8],ignore_index=True,axis=True) # (ignore_index=True)

,0,1,2,3,4,5,6,7,8,9
0,India,mumbai,India,jaipur,21344,India,mumbai,India,jaipur,21344
1,USA,pune,Pakisthan,sikar,45576,USA,pune,Pakisthan,sikar,45576
2,Canada,chennai,Japan,Jhunjhunu,87877867,Canada,chennai,Japan,Jhunjhunu,87877867

In [93]:
pd.concat([df7,df8],axis=True)

,country,city,country,city,pop,country,city,country,city,pop
0,India,mumbai,India,jaipur,21344,India,mumbai,India,jaipur,21344
1,USA,pune,Pakisthan,sikar,45576,USA,pune,Pakisthan,sikar,45576
2,Canada,chennai,Japan,Jhunjhunu,87877867,Canada,chennai,Japan,Jhunjhunu,87877867